Given a sorted array nums, remove the duplicates in-place such that each element appear only once and return the new length.

Do not allocate extra space for another array, you must do this by modifying the input array in-place with O(1) extra memory.

Example 1:
#+begin_example
Given nums = [1,1,2],

Your function should return length = 2, with the first two elements of nums being 1 and 2 respectively.

It doesn't matter what you leave beyond the returned length.
#+end_example

Example 2:
#+begin_example
Given nums = [0,0,1,1,1,2,2,3,3,4],

Your function should return length = 5, with the first five elements of nums being modified to 0, 1, 2, 3, and 4 respectively.

It doesn't matter what values are set beyond the returned length.
#+end_example
Clarification:

Confused why the returned value is an integer but your answer is an array?

Note that the input array is passed in by reference, which means modification to the input array will be known to the caller as well.

Internally you can think of this:
#+begin_example
// nums is passed in by reference. (i.e., without making a copy)
int len = removeDuplicates(nums);

// any modification to nums in your function would be known by the caller.
// using the length returned by your function, it prints the first len elements.
for (int i = 0; i < len; i++) {
    print(nums[i]);
}
#+end_example

#+begin_src java :classname RemoveDuplicatesFromSortedArray :cmdline "-cp ." :exports both :results output
  import java.util.List;
  import java.util.Arrays;
  import java.util.stream.Collectors;

  class RemoveDuplicatesFromSortedArray {
      public static void main(String[] args) {
          int[] a = new int[] {1, 1, 2};
          int aLen = solution(a);
          System.out.println("input = [1,1,2], output = " + print(a) + ", length = " + aLen);

          int[] b = new int[] {0,0,1,1,1,2,2,3,3,4};
          int bLen = solution(b);
          System.out.println("input = [0,0,1,1,1,2,2,3,3,4], output = " + print(b) + ", length = " + bLen);

      }

      static int solution(int[] nums) {
          int n = nums.length;
          if (n == 0) return 0;

          int slow = 0;
          int fast = 1;

          while (fast < n) {
              if (nums[slow] != nums[fast]) {
                  slow++;
                  nums[slow] = nums[fast];
              }

              fast++;
          }

          return slow + 1;
      }

      static String print(int[] nums) {
          return Arrays.stream(nums).boxed().collect(Collectors.toList()).toString();
      }

  }
#+end_src

#+RESULTS:
: input = [1,1,2], output = [1, 2, 2], length = 2
: input = [0,0,1,1,1,2,2,3,3,4], output = [0, 1, 2, 3, 4, 2, 2, 3, 3, 4], length = 5

* 参考资料
- [[https://labuladong.gitbook.io/algo/gao-pin-mian-shi-xi-lie/ru-he-qu-chu-you-xu-shu-zu-de-zhong-fu-yuan-su][如何去除有序数组的重复元素]]
